{
    "understanding": "Social anxiety is more than just shyness. It's an intense fear of being judged, embarrassed, or humiliated in social situations. This can lead to avoidance of social interactions and significant distress.",
    "symptoms": "Common symptoms include rapid heartbeat, sweating, trembling, difficulty speaking, nausea, and intense fear of being watched or judged by others.",
    "coping_strategies": {
        "breathing": "Practice deep breathing exercises before and during social situations. Try the 4-7-8 technique: inhale for 4 seconds, hold for 7 seconds, exhale for 8 seconds.",
        "exposure": "Start with small, manageable social situations and gradually work your way up to more challenging ones. Celebrate each small success.",
        "thought_challenging": "Identify and challenge negative thoughts about social situations. Ask yourself: 'What's the evidence for this thought? What's a more balanced way to look at this?'",
        "preparation": "Prepare for social situations by practicing what you might say or do. Role-play with a trusted friend or family member.",
        "self_compassion": "Be kind to yourself. Remember that everyone feels anxious sometimes, and it's okay to make mistakes in social situations."
    },
    "professional_help": "Consider seeking help from a mental health professional if social anxiety is significantly impacting your daily life. Cognitive Behavioral Therapy (CBT) has been shown to be particularly effective for social anxiety.",
    "lifestyle_changes": {
        "exercise": "Regular physical activity can help reduce anxiety symptoms.",
        "sleep": "Maintain a regular sleep schedule to help manage anxiety.",
        "nutrition": "Eat a balanced diet and limit caffeine and alcohol, which can worsen anxiety.",
        "mindfulness": "Practice mindfulness meditation to help stay present in social situations."
    },
    "support_systems": "Build a support network of understanding friends and family. Consider joining a support group for people with social anxiety.",
    "emergency_resources": "If you're experiencing severe distress, contact a mental health professional or crisis hotline immediately."
} 