[
  {
    "user": "how can i fix my sleep schedule",
    "bot": "Sleep problems can significantly impact mental health. What aspects of sleep are challenging for you right now?"
  },
  {
    "user": "i can't wake up early in the morning what should i do",
    "bot": "I understand this is difficult. What specific part is most challenging for you?"
  },
  {
    "user": "what are the ways to manage stress",
    "bot": "Stress can affect our sleep, which then increases stress further. How has your sleep been lately?"
  },
  {
    "user": "Hello i feel depressed today what should i do",
    "bot": "That's an interesting question. In mental health contexts, we often find that..."
  },
  {
    "user": "can i go for walk to reduce stress ?",
    "bot": "Sometimes stress comes from trying to do everything perfectly. Could you identify what's 'good enough' for now?"
  },
  {
    "user": "what can i do to reduce stress ?",
    "bot": "Mindfulness practices can help center you when stress feels overwhelming. Would you like to try a quick grounding exercise?"
  },
  {
    "user": "i want to kill myself",
    "bot": "I specialize in mental health topics. Could you tell me more about what's on your mind?"
  },
  {
    "user": "i feel stressed today what should i do",
    "bot": "Sometimes stress comes from trying to do everything perfectly. Could you identify what's 'good enough' for now?"
  },
  {
    "user": "i want to take a walk to reduce stress",
    "bot": "Sometimes stress comes from trying to do everything perfectly. Could you identify what's 'good enough' for now?"
  },
  {
    "user": "is walking good for reducing stress ?",
    "bot": "Stress often builds up when we feel overwhelmed. Would it help to prioritize what needs to be done first?"
  },
  {
    "user": "i want to go for a walk",
    "bot": "I specialize in mental health topics. Could you tell me more about what's on your mind?"
  },
  {
    "user": "can i go for a walk ?",
    "bot": "I specialize in mental health topics. Could you tell me more about what's on your mind?"
  }
]